----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 192, 14, 14]         147,648
        PatchEmbed-2             [-1, 196, 192]               0
           Dropout-3             [-1, 197, 192]               0
         LayerNorm-4             [-1, 197, 192]             384
           Dropout-5          [-1, 8, 197, 197]               0
            Linear-6             [-1, 197, 192]          37,056
           Dropout-7             [-1, 197, 192]               0
         Attention-8             [-1, 197, 192]               0
          Identity-9             [-1, 197, 192]               0
        LayerNorm-10             [-1, 197, 192]             384
           Linear-11             [-1, 197, 768]         148,224
             GELU-12             [-1, 197, 768]               0
           Linear-13             [-1, 197, 192]         147,648
          Dropout-14             [-1, 197, 192]               0
              Mlp-15             [-1, 197, 192]               0
         Identity-16             [-1, 197, 192]               0
            Block-17             [-1, 197, 192]               0
        LayerNorm-18             [-1, 197, 192]             384
          Dropout-19          [-1, 8, 197, 197]               0
           Linear-20             [-1, 197, 192]          37,056
          Dropout-21             [-1, 197, 192]               0
        Attention-22             [-1, 197, 192]               0
         Identity-23             [-1, 197, 192]               0
        LayerNorm-24             [-1, 197, 192]             384
           Linear-25             [-1, 197, 768]         148,224
             GELU-26             [-1, 197, 768]               0
           Linear-27             [-1, 197, 192]         147,648
          Dropout-28             [-1, 197, 192]               0
              Mlp-29             [-1, 197, 192]               0
         Identity-30             [-1, 197, 192]               0
            Block-31             [-1, 197, 192]               0
        LayerNorm-32             [-1, 197, 192]             384
          Dropout-33          [-1, 8, 197, 197]               0
           Linear-34             [-1, 197, 192]          37,056
          Dropout-35             [-1, 197, 192]               0
        Attention-36             [-1, 197, 192]               0
         Identity-37             [-1, 197, 192]               0
        LayerNorm-38             [-1, 197, 192]             384
           Linear-39             [-1, 197, 768]         148,224
             GELU-40             [-1, 197, 768]               0
           Linear-41             [-1, 197, 192]         147,648
          Dropout-42             [-1, 197, 192]               0
              Mlp-43             [-1, 197, 192]               0
         Identity-44             [-1, 197, 192]               0
            Block-45             [-1, 197, 192]               0
        LayerNorm-46             [-1, 197, 192]             384
          Dropout-47          [-1, 8, 197, 197]               0
           Linear-48             [-1, 197, 192]          37,056
          Dropout-49             [-1, 197, 192]               0
        Attention-50             [-1, 197, 192]               0
         Identity-51             [-1, 197, 192]               0
        LayerNorm-52             [-1, 197, 192]             384
           Linear-53             [-1, 197, 768]         148,224
             GELU-54             [-1, 197, 768]               0
           Linear-55             [-1, 197, 192]         147,648
          Dropout-56             [-1, 197, 192]               0
              Mlp-57             [-1, 197, 192]               0
         Identity-58             [-1, 197, 192]               0
            Block-59             [-1, 197, 192]               0
        LayerNorm-60             [-1, 197, 192]             384
          Dropout-61          [-1, 8, 197, 197]               0
           Linear-62             [-1, 197, 192]          37,056
          Dropout-63             [-1, 197, 192]               0
        Attention-64             [-1, 197, 192]               0
         Identity-65             [-1, 197, 192]               0
        LayerNorm-66             [-1, 197, 192]             384
           Linear-67             [-1, 197, 768]         148,224
             GELU-68             [-1, 197, 768]               0
           Linear-69             [-1, 197, 192]         147,648
          Dropout-70             [-1, 197, 192]               0
              Mlp-71             [-1, 197, 192]               0
         Identity-72             [-1, 197, 192]               0
            Block-73             [-1, 197, 192]               0
        LayerNorm-74             [-1, 197, 192]             384
          Dropout-75          [-1, 8, 197, 197]               0
           Linear-76             [-1, 197, 192]          37,056
          Dropout-77             [-1, 197, 192]               0
        Attention-78             [-1, 197, 192]               0
         Identity-79             [-1, 197, 192]               0
        LayerNorm-80             [-1, 197, 192]             384
           Linear-81             [-1, 197, 768]         148,224
             GELU-82             [-1, 197, 768]               0
           Linear-83             [-1, 197, 192]         147,648
          Dropout-84             [-1, 197, 192]               0
              Mlp-85             [-1, 197, 192]               0
         Identity-86             [-1, 197, 192]               0
            Block-87             [-1, 197, 192]               0
        LayerNorm-88             [-1, 197, 192]             384
          Dropout-89          [-1, 8, 197, 197]               0
           Linear-90             [-1, 197, 192]          37,056
          Dropout-91             [-1, 197, 192]               0
        Attention-92             [-1, 197, 192]               0
         Identity-93             [-1, 197, 192]               0
        LayerNorm-94             [-1, 197, 192]             384
           Linear-95             [-1, 197, 768]         148,224
             GELU-96             [-1, 197, 768]               0
           Linear-97             [-1, 197, 192]         147,648
          Dropout-98             [-1, 197, 192]               0
              Mlp-99             [-1, 197, 192]               0
        Identity-100             [-1, 197, 192]               0
           Block-101             [-1, 197, 192]               0
       LayerNorm-102             [-1, 197, 192]             384
         Dropout-103          [-1, 8, 197, 197]               0
          Linear-104             [-1, 197, 192]          37,056
         Dropout-105             [-1, 197, 192]               0
       Attention-106             [-1, 197, 192]               0
        Identity-107             [-1, 197, 192]               0
       LayerNorm-108             [-1, 197, 192]             384
          Linear-109             [-1, 197, 768]         148,224
            GELU-110             [-1, 197, 768]               0
          Linear-111             [-1, 197, 192]         147,648
         Dropout-112             [-1, 197, 192]               0
             Mlp-113             [-1, 197, 192]               0
        Identity-114             [-1, 197, 192]               0
           Block-115             [-1, 197, 192]               0
       LayerNorm-116             [-1, 197, 192]             384
         Dropout-117          [-1, 8, 197, 197]               0
          Linear-118             [-1, 197, 192]          37,056
         Dropout-119             [-1, 197, 192]               0
       Attention-120             [-1, 197, 192]               0
        Identity-121             [-1, 197, 192]               0
       LayerNorm-122             [-1, 197, 192]             384
          Linear-123             [-1, 197, 768]         148,224
            GELU-124             [-1, 197, 768]               0
          Linear-125             [-1, 197, 192]         147,648
         Dropout-126             [-1, 197, 192]               0
             Mlp-127             [-1, 197, 192]               0
        Identity-128             [-1, 197, 192]               0
           Block-129             [-1, 197, 192]               0
       LayerNorm-130             [-1, 197, 192]             384
         Dropout-131          [-1, 8, 197, 197]               0
          Linear-132             [-1, 197, 192]          37,056
         Dropout-133             [-1, 197, 192]               0
       Attention-134             [-1, 197, 192]               0
        Identity-135             [-1, 197, 192]               0
       LayerNorm-136             [-1, 197, 192]             384
          Linear-137             [-1, 197, 768]         148,224
            GELU-138             [-1, 197, 768]               0
          Linear-139             [-1, 197, 192]         147,648
         Dropout-140             [-1, 197, 192]               0
             Mlp-141             [-1, 197, 192]               0
        Identity-142             [-1, 197, 192]               0
           Block-143             [-1, 197, 192]               0
       LayerNorm-144             [-1, 197, 192]             384
         Dropout-145          [-1, 8, 197, 197]               0
          Linear-146             [-1, 197, 192]          37,056
         Dropout-147             [-1, 197, 192]               0
       Attention-148             [-1, 197, 192]               0
        Identity-149             [-1, 197, 192]               0
       LayerNorm-150             [-1, 197, 192]             384
          Linear-151             [-1, 197, 768]         148,224
            GELU-152             [-1, 197, 768]               0
          Linear-153             [-1, 197, 192]         147,648
         Dropout-154             [-1, 197, 192]               0
             Mlp-155             [-1, 197, 192]               0
        Identity-156             [-1, 197, 192]               0
           Block-157             [-1, 197, 192]               0
       LayerNorm-158             [-1, 197, 192]             384
         Dropout-159          [-1, 8, 197, 197]               0
          Linear-160             [-1, 197, 192]          37,056
         Dropout-161             [-1, 197, 192]               0
       Attention-162             [-1, 197, 192]               0
        Identity-163             [-1, 197, 192]               0
       LayerNorm-164             [-1, 197, 192]             384
          Linear-165             [-1, 197, 768]         148,224
            GELU-166             [-1, 197, 768]               0
          Linear-167             [-1, 197, 192]         147,648
         Dropout-168             [-1, 197, 192]               0
             Mlp-169             [-1, 197, 192]               0
        Identity-170             [-1, 197, 192]               0
           Block-171             [-1, 197, 192]               0
        Identity-172             [-1, 197, 192]               0
       LayerNorm-173                  [-1, 192]             384
          Linear-174                 [-1, 1000]         193,000
VisionTransformer-175                 [-1, 1000]               0
================================================================
Total params: 4,345,384
Trainable params: 4,345,384
Non-trainable params: 0
----------------------------------------------------------------
